Repository: 84000/data-translation-memory
Catalog: toh671-v3.tmx
Source language: bo
Languages: en

source: གྲུ་གསུམ་སེར་ནག་ཞལ་གྱི་དབྱིངས་སུ་བཞེངས། །
en: She arises within a triangular, dark yellow expanse.

source: ཡོན་ཏན་རྒྱས་མཛད་སེར་མོ་མཁའ་ལ་བཞད། །
en: She enhances good qualities, is yellow, and laughs at the sky.

source: ཕྲིན་ལས་རྒྱས་པ་ཐམས་ཅད་ཉེ་བར་མཛོད། །
en: May she perfectly carry out all enriching rites!

source: གསུང་གི་སྤྲུལ་པ་དཔལ་ལྡན་རེ་མ་ཏི། །
en: “Glorious Remati is her speech emanation.

source: གྲུ་གསུམ་དམར་ནག་ཞལ་གྱི་དབྱིངས་ནས་བཞེངས། །
en: She arises within a triangular, red expanse.

source: དམར་མོ་ཆེན་མོ་དམར་ཆེན་གཏུམ་མ་སྟེ། །
en: She is the great red one, the great red Caṇḍālī.

source: དབང་གི་ཕྲིན་ལས་ཐམས་ཅད་གྲུབ་པར་མཛོད། །
en: May she render all enthralling rites effective!

source: སྐུ་གསུང་ཐུགས་ལྡན་སྤྲུལ་པ་རྒྱ་མཚོ་མ། །
en: “Samudrā is her emanation of body, speech, and mind.

source: དྲག་པོ་འཇོམས་མཛད་བདུད་དཔུང་ཟིལ་གྱིས་གནོན། །
en: She destroys Rudra and subdues the army of māras.

source: འགྲོ་དྲུག་སྒྲོལ་མཛད་སེམས་ཅན་ཀུན་གྱི་མ། །
en: She liberates the six realms and is the mother of beings.

source: བསྟན་པ་རྒྱས་མཛད་མ་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Homage and praise to the goddess who spreads the teachings.

source: བདག་གི་ལུས་ངག་ཡིད་གསུམ་བྱིན་གྱིས་རློབས། །
en: Please bless my body, speech, and mind.”

source: དེ་ནས་དཔལ་ལྷ་མོ་ལ་ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོ་ཐགས་ཟངས་རིས་ཀྱིས་དོན་དམ་པའི་སྒོ་ནས་བསྟོད་པ། སྤྲོས་བྲལ་འོད་གསལ་ཡང་དག་ཞི་བའི་ངང་། །
en: Next, the asura king Vemacitra praised Śrīdevī in terms of the ultimate: “You are the state of perfect quiescence, luminous and free of conceptuality.

source: ཐུགས་ཀྱི་ཐུགས་མཆོག་རྣམ་དག་བདེན་པའི་ཡུམ། །གདོད་ནས་གཉིས་མེད་ནམ་མཁའི་སྙིང་པོ་ནི། །
en: You are the true mother, the pure, supreme heart essence, And the essence of primordially nondual space.

source: དཔལ་ལྡན་ཁྱོད་ཀྱི་རང་བཞིན་ཁྱད་པར་གསལ། །
en: Glorious one, your nature is exceedingly clear.

source: འདི་ལྟར་རྣམ་དག་བརྗོད་མེད་ངོ་བོ་ལ། །
en: “This essential nature is utterly pure and ineffable.

source: བྱིས་པ་རྣམས་ཀྱིས་བསྟོད་པ་བྱེད་པ་ལྟུང་། །
en: Praises to it composed by the naïve fall short.

source: བླུན་པོ་རྣམས་ཀྱིས་དངོས་པོར་རབ་བརྟགས་ནས། །གཟུགས་ཅན་ཚུལ་དུ་གང་ཞིག་བསྟོད་པའི་ཚིག །
en: Fools imagine you to be substantial And speak words of praise as if you have a physical form.

source: རྒྱལ་བའི་དོན་ཡང་ཐུགས་ཆུད་ཁྱོད་ཉིད་ལ། །ཚིག་དང་ཡི་གེའི་སྒོ་ནས་བསྟོད་པ་རྣམས། །ནམས་ཀྱང་གྲོལ་བར་འགྱུར་བའི་ཆོས་ཉིད་མིན། །
en: “But any praise based on words and letters, Directed to you, who is fixed upon the Victor’s truth, Is never the true reality of liberation.

source: གདོད་ནས་གཉིས་མེད་བདེ་ཆེན་མ་རྟོགས་པར། །ཁྱོད་ཀྱི་སྨོན་ལམ་རྟགས་ཀྱི་ཆོ་འཕྲུལ་ལ། །དོན་དུ་བཟུང་ནས་གང་ཞིག་བསྟོད་པ་རྣམས། །ཁྱོད་ལ་བརྟེན་ནས་ཐམས་ཅད་ལྟུང་བར་འགྱུར། །
en: When primordial nondual great bliss has not been realized, Praise inspired by you will always fall short, When it takes you to be a symbolic emanation of your aspirations.

source: གང་ཞིག་སྐྱེ་བ་མེད་པར་ཤེས་པ་དང་། །གདོད་ནས་གཉིས་མེད་སྙིང་པོ་བསྒོམས་ནུས་ན། །གང་ཟག་དེས་ནི་ཁྱོད་ཉིད་བསྟོད་པ་ཡིན། །
en: “A person who understands nonarising And can meditate on the essence of primordial nonduality Is someone who truly praises you.

source: ཁྱོད་ཀྱི་གཟུགས་དང་ཁ་དོག་འཛིན་པ་ཡིས། །བསྐལ་པ་གྲངས་མེད་འདས་པར་རབ་བལྟས་ཀྱང་། །ཁྱོད་ཀྱི་གཟུགས་དང་ཁ་དོག་མཐོང་མི་ནུས། །གང་ཞིག་གཟུགས་སུ་མི་འཛིན་རྣམས་ཀྱིས་མཐོང་། །
en: “Those who grasp at your form and color Might gaze upon you for countless eons And still not be able to see your form and color, While those who do not grasp at form will see.

source: སྒྲ་དང་ཚིག་དང་བརྗོད་པ་ཐམས་ཅད་ཀྱིས། །ཁྱོད་ནི་བོས་ཀྱང་བསྐལ་པར་མི་ཐོས་ཏེ། །
en: “They will use all manner of sounds, words, and expressions, To call out to you for an eon, but you will not hear.

source: འདི་དག་སྤངས་པའི་རྣལ་འབྱོར་དེ་ཡིས་ནི། །ཁྱོད་ཀྱང་བོས་ལ་དེ་ཡང་ཁྱོད་ཀྱིས་ཐོས། །
en: However, you will hear the call of those yogins, Who have abandoned such things.

source: གང་ཞིག་ལུས་ངག་དགེ་བས་ཁྱོད་བསྒྲུབས་པའི། །བླུན་པོ་དེ་ཡིས་ནམས་ཀྱང་ཁྱོད་ཉིད་སྤངས། །ལུས་ངག་སྤངས་པའི་སེམས་ཀྱིས་ཁྱོད་མཆོད་ནས། །མཆོད་ན་དངོས་གྲུབ་དེ་ཡིས་གཏེར་ཐོབ་འགྱུར། །
en: “A fool who has accomplished your practice Through the virtues of body and speech will always forsake you, While one who worships you with a mind that rejects body and speech Will attain the treasure of accomplishment when they worship.

source: ཁྱོད་ནི་རྒྱལ་པོ་མང་པོའི་ཡོན་ཏན་སྡུད། །ཆོས་ཀྱི་དབྱིངས་ན་རྒྱལ་བ་རྣམས་དང་མཇལ། །
en: “You epitomize the qualities of the multitudes of victors And commune with the victors in the dharmadhātu.

source: ཟབ་མོ་དབུ་མའི་རང་བཞིན་སྟོན་པའི་ཕྱིར། །མི་མཇེད་འཇིག་རྟེན་ཤིན་ཏུ་རྩུབ་པ་འདིར། །ཕྱི་རོལ་ཚུལ་གྱིས་ཐམས་ཅད་འདྲེན་མཛད་མ། །
en: Because you display the nature of the profound middle way, You take on a non-Buddhist form to guide all beings In this exceedingly harsh Sahā world.

source: ཁྱོད་ཀྱི་སྐུ་ནི་འདི་ལྟར་རབ་བརྟགས་པ། །སྒྲིབ་པ་མང་པོ་སྟོང་ཉིད་ངང་དུ་གཤེགས། །
en: “Your body, imagined in this way, Has reached the state of being empty of the manifold obscurations.

source: སྟོང་ཉིད་དམ་པ་སྟོང་པ་ཡང་དག་ཁྱོད། །སྟོང་པ་གཉིས་མེད་ཤེས་པ་རྣམས་ཀྱིས་བསྟོད། །
en: You, supreme emptiness and truly empty, Are praised by those who understand the empty and nondual.

source: འདི་ལྟར་བསྟོད་ན་བསྟོད་པར་འགྱུར་གྲང་བས། །ཁྱོད་ནི་བསྟོད་པའི་ཡུལ་ཅན་མ་ཡིན་ཡང་། །བྱིས་པ་དྲང་ཕྱིར་དོན་ལ་འདི་ལྟར་བསྟོད། །
en: “To praise you in this way counts as a form of praise, And though you are not an object of praise, I praise you like this to guide naive people.”

source: དེ་ནས་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་རྡོ་རྗེ་གསེར་མིག་ཅན་གྱིས་དཔལ་ལྷ་མོ་ལ་བསྟོད་པ། དཔལ་ལྡན་ལྷ་མོ་དཔག་པར་དཀའ་བའི་དོན། །
en: Next, the king of garuḍas Vajra Golden Eyes praised Śrīdevī: “Śrīdevī, your import is difficult to fathom.

source: ཐབས་ཀྱི་ཆོ་འཕྲུལ་ནམ་མཁའི་མཁའ་ལ་སྤྱོད། །
en: Your skillful emanations move through the sky.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྲུལ་པ་ཁྱོད་ཉིད་ལ། །སྒོ་གསུམ་རྡུལ་སྙེད་དབྱངས་ཀྱིས་ཕྱག་འཚལ་བསྟོད། །
en: I revere and praise you as an emanation of a bodhisattva, With melodies, numerous as grains of dust, from my three doors.

source: བདག་གིས་ཁྱོད་ནི་མཆོད་པས་མ་བསྒྲིབས་ཀྱང་། །དཔལ་ལྡན་དངོས་གྲུབ་དམ་པ་ཐོབ་བྱའི་ཕྱིར། །འདོད་པའི་ཡོན་ཏན་མཁའ་ལ་ཆར་འབབ་པས། །མཆོད་པའི་ཚོགས་འདིས་དབང་པོ་རྒྱལ་གྱུར་ཅིག །
en: “Though you are untainted by the offerings I make, May objects pleasing to the senses fall from the sky like rain, Glorious One, so that the sublime accomplishment may be attained— And may these abundant offerings conquer the senses.

source: དཔལ་ལྡན་ཁྱོད་ནི་དགེ་སྡིག་བདག་པོ་སྟེ། །
en: “Glorious One, you have dominion over good and evil.

source: བདག་གི་ལུས་ངག་ཡིད་ཀྱི་སྡིག་པའི་ཚོགས། །ཁྱོད་ཀྱི་ཐད་དུ་འགྱོད་པས་རབ་བཤགས་ན། །
en: I regretfully confess before you All of my wicked bodily, verbal, and mental acts.

source: ཐུགས་རྗེའི་ཤུགས་ཀྱིས་སྒྲིབ་པ་བྱང་བར་མཛོད། །
en: Out of compassion, please purify my obscurations.

source: ཁྱོད་ཀྱི་ཁྱད་པར་ཡོངས་སུ་འཕགས་པ་ནི། །འགྲོ་བའི་དོན་མཛད་བདག་དོན་ཕུན་སུམ་ཚོགས། །
en: “You are particularly exalted for the benefit you bring beings And the abundant prosperity benefits you bring yourself.

source: དགའ་མཐུན་ཕྲག་དོག་མེད་པའི་སྤྲོས་པ་ནི། །རྗེས་སུ་ཡི་རང་ཁྱོད་ཀྱི་རྒྱུད་ལ་འབུལ། །
en: I rejoice and offer harmonious joy free of envy, To the continuity of your being.

source: འདི་ལྟར་ཡོན་ཏན་ལྡན་པའི་སྐུ་མཆོག་ནི། །ནག་མོ་བཟང་པོ་འཇིགས་པའི་མཐུ་སྟོབས་ཀྱིས། །ཕྱོགས་བཅུ་དུས་གསུམ་ཀུན་དུ་འགྲོ་དོན་ལ། །སྒྱུ་འཕྲུལ་དྲ་བའི་ཚུལ་གྱིས་བསྐུལ་བར་སྤོབས། །
en: “Beautiful Kālī, whose supreme body has Such wonderful qualities, I implore you— Use your terrifying power as the web of illusion To benefit beings throughout the three times and ten directions.

source: ཡང་དག་ཁྱོད་ཀྱི་ཡོན་ཏན་སྐུ་མཆོག་ནི། །གདུག་པ་འདུལ་ཞིང་བསྟན་པ་བསྲུང་བའི་ཕྱིར། །སེམས་ཅན་ཟད་པར་མ་གྱུར་བར་དུ་ནི། །མྱ་ངན་མི་འདའ་བཞུགས་པར་གསོལ་བ་གདབ། །
en: “I request that your supreme body with its unique qualities Remain without passing into nirvāṇa As long as beings endure, To tame wicked beings and protect the teachings.

source: འདི་ལྟར་ཕྱག་འཚལ་མཆོད་ནས་བཤགས་པ་དང་། །རྗེས་སུ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བཏབ་ནས། །དགེ་བ་འདི་ཡིས་ངན་སོང་སྟོངས་གྱུར་ཏེ། །ཐམས་ཅད་ཚོགས་རྫོགས་བྱང་ཆུབ་ཆེན་པོར་བསྔོ། །
en: “May the virtue from this homage, confession, Rejoicing, encouragement, and requesting Empty the lower realms—I dedicate it so that all Will perfect the accumulations and reach great awakening.”

source: དེ་ནས་དཔལ་ལྡན་ལྷ་མོ་ལ་ནམ་མཁའི་ལྷ་བྲན་རྣམས་ཀྱིས་བསྟོད་པ། བསྐལ་པ་མེ་ལྟར་འབར་བའི་ཀློང་དཀྱིལ་ན། །རླུང་ནག་དགུ་པའི་ཀློང་འཁྱིལ་ཕོ་བྲང་ནས། །མ་གཅིག་འདོད་པའི་ཁམས་ཀྱི་དབང་ཕྱུག་མ། །བདུད་ཀྱི་ཡུམ་ལ་གཤིན་རྗེའི་ལྕམ་གཅིག་མ། །དཔལ་ལྡན་ལྷ་མོ་ནག་མོ་རེ་མ་ཏི། །
en: Next, the attendants of the sky god praised Śrīdevī: “From a palace in the middle of a swirling expanse of nine dark winds, At the center of a vast blaze like the fire at the end of an eon, You emerge as the sole mother, sovereign goddess of the desire realm, The mother of the demon, and Yama’s only sister.

source: ནག་མོ་ཟ་བྱེད་རྔམ་པའི་མཆེ་བ་ཅན། །མཐིང་ནག་གཅེར་བུ་ཁྲག་གི་རལ་པ་ཅན། །
en: “You are Śrīdevī, the black Remati, The black devourer with awesome fangs, Dark black, naked, and with bloody locks.

source: ཁྱོད་ཀྱི་སྐུ་མདོག་ནག་མོར་བཞུགས་པ་ནི། །དོན་དམ་དབྱིངས་ཀྱིས་བསྐྱོད་པ་མེད་པའི་རྟགས། །
en: “Your appearance with a black body Symbolizes not being agitated by ultimate space.

source: དབུ་སྐྲ་གཡས་ནས་གཡོན་དུ་འཁྱིལ་པ་ནི། །ཡུམ་གྱི་མཁའ་ལ་སྤྲུལ་པ་འགྱེད་པའི་རྟགས། །
en: The leftward curl of your hair Symbolizes sending emanations into a mother’s womb.

source: དབུ་གཙུག་རལ་པ་གཅིག་ཏུ་འཁྱིལ་པ་ནི། །དོན་དམ་དགོངས་སྤྱོད་གཅིག་ཏུ་མཛད་པའི་རྟགས། །
en: “The locks on your head are braided as one, Symbolizing that you combine recognition of the ultimate with action.

source: རལ་པའི་གསེབ་ནས་མེ་སྟག་འཕྲོ་བ་ནི། །ཐུགས་ཀྱི་སྤྲུལ་པ་ཕྱོགས་བཅུར་འགྱེད་པའི་རྟགས། །
en: The sparks that fly from your locks Symbolize sending mind emanations throughout the ten directions.

source: དབུ་ལ་ཐོད་རློན་ཕྲེང་བ་བཅིངས་པ་ནི། །ཐུགས་རྗེས་སྤྲུལ་སྐུས་འགྲོ་དོན་མཛད་པའི་རྟགས། །
en: “The garland of fresh skulls tied around your head Symbolizes your compassionate benefit to beings with your emanation body.

source: སྙན་ཆ་གཡས་ན་སེང་གེ་མཆོང་བ་ནི། །སྨན་མོ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པའི་རྟགས། །
en: The pouncing lion on your right earring Symbolizes your subjugation of all menmos.

source: གཡོན་ན་སྦྲུལ་མགོའི་གདེངས་ཀ་འཕྱར་བ་ནི། །ཞེ་སྡང་མ་སྤངས་དབྱིངས་སུ་དག་པའི་རྟགས། །
en: “The serpent with a flared hood on your left earring Symbolizes purity within the expanse where anger is not abandoned.

source: སྙན་ཆ་གསེར་གྱི་དྲིལ་བུ་འཁྲོལ་བ་ནི། །སངས་རྒྱས་ཀུན་ལ་བསྙེན་སྒྲུབ་བྱེད་པའི་རྟགས། །
en: The ringing golden bells on your earrings Symbolize your worship and accomplishment of all the buddhas.

source: སྤྱན་རྩ་དམར་ལ་སྡང་མིག་བགྲད་པ་ནི། །སྲིད་གསུམ་རྣལ་འབྱོར་དམ་ཚིག་གཟིགས་པའི་རྟགས། །
en: “The wide-eyed glare of your bloodshot eyes Symbolizes that you observe the samayas of yogins in the three existences.

source: ཞལ་གྱི་དྲག་པོ་ཧོམ་ཁུང་གདེངས་པ་ནི། །བསྟན་པ་འཇིག་པའི་རུ་དྲ་སྒྲོལ་བའི་རྟགས། །
en: The fierce open fire pit of your mouth Symbolizes the liberation of Rudra, destroyer of the teachings.

source: རྣོ་གདུག་མཆེ་བ་ཟུར་གསུམ་གཙིགས་པ་ནི། །བསྒྲལ་བའི་ཞིང་བཅུ་ས་ལ་སྒྲོལ་བའི་རྟགས། །
en: “Bearing your sharp and poisonous triangular fangs Symbolizes liberating the ten targets for liberation onto the bodhisattva levels.

source: སྐུ་ལ་ཞིང་ལྤགས་གཡང་གཞི་གསོལ་བ་ནི། །ཡང་དག་ཆོས་དང་དོན་དང་ལྡན་པའི་རྟགས། །
en: Dressing in human skin and an antelope hide Symbolizes that you possess the true Dharma and its meaning.

source: གླང་ཆེན་ཀོ་རློན་སྣམ་ཕྱེད་དཀྲིས་པ་ནི། །ཐེག་པ་མཆོག་གི་དོན་དང་ལྡན་པའི་རྟགས། །
en: “Being wrapped in a fresh elephant hide Symbolizes that you possess the meaning of the supreme vehicle.

source: རེ་ལྡེ་ནག་པོ་སྣམ་ཕྱེད་དཀྲིས་པ་ནི། །འཇིག་རྟེན་འདི་ན་ཆེ་བཙན་ལྡན་པའི་རྟགས། །
en: That you wear black felt Symbolizes your majesty in this world.

source: ལྟེ་བའི་ཁུང་ནས་ཉི་མ་འཆར་བ་ནི། །སྡུག་བསྔལ་རྒྱ་མཚོ་གཏིང་ནས་སྐེམས་པའི་རྟགས། །
en: “The sun shining from your navel Symbolizes drying the ocean of suffering to its depths.

source: སྤྱི་བོ་གཙུག་ནས་ཟླ་བ་འཆར་བ་ནི། །དུག་གསུམ་མ་རིག་མུན་པ་སེལ་བའི་རྟགས། །
en: The moon shining from the crown of your head Symbolizes clearing away the three poisons’ dark ignorance.

source: ཞབས་ལ་དབང་གི་ལྕགས་སྒྲོག་འཁྲིལ་བ་ནི། །ཐབས་དང་ཤེས་རབ་ཟུང་དུ་འབྲེལ་བའི་རྟགས། །
en: “The restraining shackles clasping your feet Symbolize the unification of method and insight.

source: ཕྱག་གཡས་ཤང་ལང་ནག་པོ་བསྣམས་པ་ནི། །སྡུག་བསྔལ་སྐྱེ་ཤི་རྩད་ནས་གཅོད་པའི་རྟགས། །
en: That you wield a black sword in your right hand Symbolizes the eradication of suffering, birth, and death.

source: ཕྱག་གཡོན་ཐོད་རློན་དམར་ཆེན་འཐུང་བ་ནི། །འཁོར་བའི་སྡུག་བསྔལ་ཁྲག་ལྟར་འཐུང་བའི་རྟགས། །
en: “That you drink human blood from a fresh skull in your left hand Symbolizes drinking the suffering of saṃsāra like blood.

source: བོང་བུ་གྭ་པ་ཕྱིན་ཕྱོགས་ཞོན་པ་ནི། །ལོག་པར་ལྟ་བའི་སེམས་ཅན་སྒྲོལ་བའི་རྟགས། །
en: That you ride sideways on a white-faced donkey Symbolizes liberating beings who hold wrong views.

source: སྲིན་པོའི་ཨོག་མས་སྔ་རུ་བྱས་པ་ནི། །སྲིན་ཡུལ་ལང་ཀ་པུ་ར་འདུལ་བའི་རྟགས། །
en: “The front of your saddle is made from a rākṣasa’s throat, Symbolizing the taming of Laṅkapura in the realm of the rākṣasas.

source: སྦྲུལ་ནག་ཆུན་པོས་གོང་སྨེད་བྱས་པ་ནི། །ཞེ་སྡང་དབང་གིས་བགེགས་རིགས་འཇོམས་པའི་རྟགས། །
en: The upper and lower bridle, made of a large black snake, Symbolizes your anger that conquers the classes of obstructing beings.

source: རུ་སྦལ་ནག་པོའི་ཕོག་བུ་བཏང་བ་ནི། །ཀླུ་བདུད་ནག་པོ་དམ་ལ་བཏགས་པའི་རྟགས། །
en: “Swinging your riding crop made out of black tortoiseshell Symbolizes binding the black nāgas and māras under oath.

source: སྔ་ཤ་གཡས་པ་བདུད་ཀྱི་ཁྲམ་བམ་ནི། །དམ་ཚིག་ཉམས་པ་ཁྲམ་ལ་འདེབས་པའི་རྟགས། །
en: The cross of the māras on the right saddle strap Symbolizes pinning those who violate the samayas to a cross.

source: ཕྱི་ཤར་ནད་ཀྱི་རྐྱལ་པ་བཏགས་པ་ནི། །བསྟན་པ་འདི་ལ་གནོད་པའི་དགྲ་བོ་ལ། །ནད་ཀ་འབེབས་ཤིང་དལ་ཁ་སྒྱུར་བའི་རྟགས། །
en: “The satchel of diseases that hangs on the rear saddle straps Symbolizes averting misfortune and bringing disease down On those who would harm this teaching.

source: དོན་དམ་བཅུད་ཀྱི་རྟགས་སུ་ཞག་གི་ཟོར་རིས་བཏང་། །ཐུགས་རྗེ་ཆགས་པའི་རྟགས་སུ་རཀྟའི་ཐིག་ལེས་བརྒྱན། །འདུལ་བྱེད་ཕྲིན་ལས་རྟགས་སུ་ཐལ་བའི་མཚན་མས་བཏབ། །
en: “You exude drops of fat that symbolize the nectar of the ultimate, Are ornamented with drops of blood symbolizing your fondness for compassion, And are imprinted with an ash mark symbolizing your activities to tame beings.

source: མ་མོ་འབུམ་ཕྲག་བྲན་དུ་འཁོལ་བ་ནི། །ཁམས་གསུམ་ཁྱབ་པར་ཕྲིན་ལས་མཛད་པའི་རྟགས། །
en: “The myriad mātṛkās bound to you in service Symbolize the activities you perform, which pervade the three realms.

source: མ་གཅིག་ཁ་ནས་མེ་འབར་རྒྱ་མཚོ་སྐེམས། །རྡོ་རྗེ་འཕྱར་བས་རི་རབ་ཚོགས་བོར་འཕེན། །
en: The fire blazing from your mouth, sole mother, dries up the oceans, And by raising your vajra you hurl the Sumeru mountain range.

source: བདག་གིས་བརྩོན་པར་ལྷ་མོ་ཁྱོད་ལ་བསྟོད། །
en: I fervently praise you, Goddess!”

source: དེ་ནས་ཡང་གཤིན་རྗེ་ནག་པོས་དཔལ་ལྷ་མོ་ལ་ཆེ་བའི་ཡོན་ཏན་གྱི་སྒོ་ནས་བསྟོད་པ། ལྷ་མོ་དཔལ་ལྡན་མཁའ་འགྲོ་ནག་མོ་ཁྱོད་ལ་ནི། །རྒྱུན་དུ་ཏིལ་མར་གྱིས་བྱུགས་ལན་བུ་གཅིག་མ་སྟེ། །
en: Next, Black Yama praised the great goddess in terms of her superior qualities: “Goddess, glorious black ḍākinī, your single braid is perpetually saturated with sesame oil.

source: རོ་ཉེ་རྣ་ཆས་བསྒྱིངས་ཤིང་ཆ་ལུགས་མང་པོ་འཆང་བྱེད་མ། །
en: You are poised seductively wearing lead earrings and you bear many ornaments.

source: རྒྱན་དུ་རྐང་སྒྲོག་ལྕགས་ལ་བྱས་པ་གཅིག་གིས་རྐང་ལ་མཛེས་པར་བརྒྱན་པ་སྟེ། །
en: A single iron shackle beautifully adorns your feet as anklets.

source: མཚན་མོ་བོང་བུ་ཞོན་ནས་འགྲོ་བ་དེ་ནི་ནག་མོ་ཁྱོད་ཉིད་ཡིན་པར་ཤེས། །
en: You are known as Kālī, the one who rides around at night on a donkey.

source: རལ་པས་བདག་ཉིད་མཛེས་པར་བརྒྱན་ཏེ་ཁྱོད་ཀྱི་སྤྱོད་པ་མཚོ་ཆེན་དོན་དག་སུ་ཡིས་ཤེས། །
en: Beautifully adorned with locks as you are, who can fathom the import of the great ocean of your behavior?

source: འཁོར་བ་འཇིག་པའི་ཚེ་ན་མི་རུས་དག་ལ་ཁྲག་དང་ཞག་འཛག་དུ་བ་ཐུལ་བ་ན། །ནག་མོ་མཆེ་བ་མི་བཟད་ཁྱོད་ཀྱི་ཞལ་དུ་འགྲོ་ཀུན་སྐད་ཅིག་ཙམ་དུ་ཞུགས་པར་འགྱུར། །
en: When saṃsāra is destroyed, when smoke billows from the blood and fat dripping from human bones, then, Kālī, all beings will instantly fall into your mouth—into your unbearable fangs.

source: ལྷ་མོ་ལག་ན་མི་ཐོད་ཐོགས་པ་ཁྱོད་ནི་རྣལ་འབྱོར་གྲུབ་པའི་རྣལ་འབྱོར་ཅན་དུ་དུར་ཁྲོད་དགྱེས།
en: “Goddess, you hold a human skull in your hand, reveling in the charnel ground while immersed in the accomplishment of yoga.

source: ཁྱོད་ནི་གཡོག་བཅས་མྱ་ངན་མེད་ཅིང་འཆི་བའི་འཇིགས་པ་མེད་པར་དྲིལ་བུའི་སྒྲ་ཡང་སྒྲོགས། །
en: You and your attendants have no sorrow and ring your bells with no fear of death.

source: ཁྱོད་ནི་དཔའ་བོ་དག་གི་མགོ་བཅད་གཡུལ་དུ་མཚོན་གྱིས་བསད་པ་ཡི། །མགོ་ཕྲེང་ལག་ན་ཐོགས་ཤིང་གར་སྟབས་སྐོར་ཞིང་ལག་པ་བརྐྱང་བསྐུམ་ཆེ། །
en: You hold a garland of heads—the severed heads of heroes cut down by swords in battle—as you dance in a circle, arms extending and retracting mightily.

source: རྐུབ་ཚོས་ཆེ་ལ་ཀླུ་དབང་གཤིབས་པའི་སྐ་རགས་བཅིངས་ཤིང་ལག་ན་མདུང་དང་བ་དན་ཐོགས། །
en: A belt made of woven nāga lords is tied around your broad hips and you brandish a spear and standard in your hand.

source: ཁྲག་གི་ཆང་གིས་ར་རོ་མྱོས་ཏེ་མིག་རྩ་དམར་པོར་བྱས་ནས་མཚན་མོ་དུར་ཁྲོད་རྒྱུ་བ་འབྱུང་པོ་ཕལ་ཆེན་ཀུན་གྱིས་མཐོང་། །
en: Your eyes are bloodshot from being intoxicated with the liquor of blood and you are watched by the host of bhūtas who wander cremation grounds at night.

source: རྐང་པའི་གོས་ནི་ཀོ་རློན་མཚན་པས་དྲངས་པས་སྣམ་གྱི་ཕྱེད་ནི་རེ་ལྡེས་དཀྲིས། །
en: Your leggings are made from fresh hidesand you are wrapped in a felt shawl.

source: མི་ཡི་རྒྱུ་མ་སར་པའི་སྦུབས་ཀྱིས་ཞལ་གྱི་ཟླ་བ་བརྒྱན་ཅིང་ཁྲག་དང་ཞག་གི་ཚོམ་བུས་ཐིག་ལེར་བརྒྱན། །
en: Your moon-like face is graced with a hood of fresh human intestines and your forehead mark is made of a clump of blood and fat.

source: མི་ཡི་ཤ་ལ་སོ་སོར་ཆེམ་ཆེམ་ཟ་ཡིན་མི་རོ་དག་གི་ཅོད་པན་མགོ་ལ་བརྒྱན་པ་སྟེ། །
en: You gnash noisily on bits of human flesh and wear a crown of human corpses on your head.

source: བདག་ལ་སྐྱོབ་པའི་དྲག་མོ་མི་ཤ་ཐོགས་པ་ཁྱོད་ནི་སྔ་ནས་མ་མཐོང་གཟོད་མཐོང་ན། །བདུད་དང་སྲིན་མོ་མ་མོ་རྣམས་ཀྱང་མིག་རྩ་རིག་རིག་དངང་ཞིང་ཁྱོད་ལ་འདུད། །
en: “Wrathful protector of mine, with human flesh in hand, the eyes of māras, rākṣasīs, and mātṛkās who see you now for the first time quiver and bulge as they bow to you.

source: ལྷ་མོ་བཟང་མོ་ལུས་མདོག་གནག་ཅིང་བཟོད་པར་དཀའ་བ་ཁྱོད་ལ་བརྒྱ་བྱིན་ལ་སོགས་པས། །བསྟོད་པ་བྱེད་པའི་གཤིན་རྗེའི་རྒྱལ་པོ་ཉིད་ཀྱང་རྟག་ཏུ་འདུད། །
en: Beautiful Goddess, your body is black and you are so overwhelming even I, Yamarāja, praised by Śakra and the rest, always bow to you.

source: ལྷ་རྣམས་དང་ནི་འགྲོ་བ་མ་ལུས་འཇུག་བརྟུལ་བས་ན་རྣ་བ་ཡ་གཅིག་ལ། །བྲང་གིས་འགྲོ་བ་སྦྲུལ་མགོ་གདེངས་ཀ་སྟོང་དང་ལྡན་ཞིང་གཅིག་གིས་རྒྱབ་ནས་རྒྱན་དུ་བྱས། །
en: Because you bring an end to all gods and beings, an uraga with a thousand hooded heads adorns one of your ears from behind and an incomparable lion is fastened to the other ear.

source: ཡ་གཅིག་ལ་ནི་སེང་གེ་མཚུངས་མེད་ཐོགས་ཤིང་རྒྱ་མཚོ་བསྐོར་ཞིང་ས་གཞི་གནོན་པ་ས་སྟེང་གི། །ཕྱོགས་ནས་རྒྱུ་བའི་ཉི་མ་ཟླ་བ་ལྷ་མོ་ཁྱོད་ཀྱི་ལྟེ་ནས་འཆར་ཞིང་སྲིད་གསུམ་ཟིལ་གྱིས་གནོན། །
en: You are surrounded by an ocean, trample the earth, and the sun and moon that course over the earth rise from your navel. Goddess, you conquer the three existences.

source: རྒྱ་མཚོ་ཀློང་ནས་མེ་འབར་ཆུ་རྣམས་སྐེམས་པར་བྱེད་པར་ནུས་པའི་བུད་མེད་ཐམས་ཅད་ཞི་མཛད་མ། །
en: You are the all-pacifying woman who is able to dry up all waters with the fire that blazes from the vast ocean.

source: ལྷ་ཆེན་སྐུ་དང་འཚམ་པར་བཞུགས་པའི་དཀའ་ཟློག་ནག་མོ་མི་ནད་ཕྱུགས་ནད་ཀུན་ལ་འཇིགས་པ་མེད། །
en: Black Durgā, whose form resembles that of Mahādeva, you do not fear any human or animal disease.

source: མ་གཅིག་ཁྱོད་ཉིད་ལ་ནི་བདག་ནི་གུས་པར་ཕྱག་འཚལ་མཆོད་ཅིང་བསྟོད་པར་བགྱི། །
en: “I respectfully offer homage and praise to you, sole mother.”

source: དེ་ནས་དཔལ་ལྷ་མོ་ནག་མོ་ལ་བྲམ་ཟེ་མཆོག་སྲེད་ཀྱིས་ཀུན་རྫོབ་ཀྱི་བདེན་པ་བརྟེན་པར་བསྟོད་པ། མ་གཅིག་ལྷ་མོ་དཔལ་ལྷ་མོ། །རྡོ་རྗེ་ལྷ་མོ་ནག་མོ་ཆེ། །མཐུ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་བསྟོད། །
en: Next, the brahmin Vararuci praised Śrīdevī Kālī in terms of the relative truth: “Homage and praise to you, Sole mother, goddess, Śrīdevī, Vajra goddess Kālī, great and powerful.

source: བདག་གིས་བཙུན་པར་ཁྱོད་བསྟོད་ཀྱིས། །
en: May my reverent praise to you Bring supremely good fortune and desired riches.

source: བཀྲ་ཤིས་མཆོག་གྲུབ་སེམས་གཏེར་གནས། །ཡིད་མྱུར་གཟུགས་ཆེན་ཀུན་དུ་གྲགས། །མ་མོར་གྲགས་ཤིང་འཇིག་རྟེན་སྐྱོང་། །དཔའ་བརྟུལ་དྲག་སྤྱོད་བརྩོན་འགྲུས་ཆེ། །འཐབ་མོ་གཡུལ་ལས་རྟག་ཏུ་རྒྱལ། །
en: “Your swift mind and great form are known far and wide, You are a renowned mātṛkā, a world protector, A fierce warrior with great perseverance, Who is always victorious on the battlefield.

source: གཤིན་རྗེའི་སྲིང་མོ་ཡིན་པར་བསྟོད། །
en: Praise to you, Yama’s sister.

source: གོས་སུ་དར་གོས་སྔོན་པོ་གསོལ། །སྡུག་དང་མི་སྡུག་ཆ་ལུགས་འཆང་། །སྤྱན་མིག་མཐོང་ན་མི་སྡུག་ཀུན་དུ་སྡང་། །དད་ཅིད་ཚོགས་པའི་མི་རྣམས་སྡུད། །
en: “You are dressed in blue silk, Wear adornments both beautiful and hideous, Have eyes that are hideous and enraged, Are faithful, and gather people in the assembly.

source: རེས་འགའ་རི་བྲག་ཟབ་མོར་གནས། །རེས་འགའ་ཚལ་དང་ཤིང་ལ་གནས། །རེས་འགའ་དུར་ཁྲོད་དབུས་ན་གནས། །ལྷ་མོའི་གནས་རྟེན་དེ་རུ་འཆའ། །
en: “Sometimes you dwell deep in the mountains, Sometimes you dwell in forests and trees, And sometimes you dwell in the middle of a charnel ground Where shrines of the goddess have been built.

source: གནས་དེ་རི་དང་ཚལ་དགོན་དུ། །རྟག་ཏུ་ལྷ་མོ་ཁྱོད་བསྟོད་ན། །དེ་ཡིས་དགོངས་པ་སྐོང་བར་བྱེད། །
en: “When, people continually praise you, Goddess, In those places, in remote mountains and forests, You are compelled to fulfill their intentions.

source: བདག་གིས་རྟག་ཏུ་བསྟོད་བྱས་ན། །བདག་གི་བསམ་པ་འགྲུབ་པར་མཛོད། །
en: When I continually praise you, Please fulfill my wishes as well.

source: རྨ་བྱའི་སྒྲོ་ལ་རྒྱལ་མཚན་བྱས། །
en: “Your banner is made of peacock feathers.

source: གང་ཞིག་རྟག་བསྟེན་སྲུང་བར་བྱེད། །གནག་ལུག་ཕྱུགས་རྣམས་འཕེལ་བར་བྱེད། །
en: You protect those who continually serve you And cause livestock to flourish.

source: སེང་གེ་སྟག་དང་སྤྱང་ཀི་ཡིས། །རྟག་ཏུ་ཀུན་ནས་བསྐོར་ནས་ཀྱང་། །
en: “You are constantly surrounded on all sides By lions, tigers, and wolves.

source: རྡོ་རྗེ་དྲིལ་ཆེན་སྙན་པར་སྒྲོགས། །བྱིན་ཏེ་དྲིལ་ཆེན་སྙན་པར་སྒྲོགས། །
en: You ring the great vajra bell And grant boons as the great bell rings.

source: ལན་འགའ་ལག་ན་ཏྲི་ཤཱུ་ལ་ཐོགས། །
en: “Sometimes you hold a trident in your hand.

source: ལན་འགའ་ཉི་ཟླའི་རུ་མཚོན་ཕྱར། །
en: Sometimes you raise a sun and moon standard.

source: མར་གྱི་ཚེས་དགུ་བཅུ་གཅིག་ན། །དེ་ཡི་དུས་སུ་མཆོད་བྱས་ན། །ལྷ་མོ་ཁྱོད་ལས་ལྷག་པ་མེད། །བདུད་འདུལ་ལྷ་མིན་སྲིན་མོར་སྟོན། །དགྲ་དང་འཐབ་ཚེ་རྒྱལ་བར་བྱེད། །
en: “If someone worships you during the waning moon On either the ninth or eleventh day, You, goddess whom none surpass, The tamer of māras, teacher of asuras and rākṣasīs, Grant them victory over their enemies and in battle.

source: བུད་མེད་ནང་ན་མཆོག་ཡིན་ཏེ། །ཚིག་དབང་འཇིག་རྟེན་མགོན་པོ་འདྲ། །
en: “You are supreme among women, Like the world-protecting Vāgīśvarī.

source: རྒྱལ་པོའི་ཁབ་ན་པདྨ་འདྲ། །
en: You are like a lotus in a king’s palace.

source: ཞལ་བཟང་ཟླ་བ་ཉ་བ་འདྲ། །
en: Your beautiful face is like a full moon.

source: ཆུ་ལ་རྒལ་ན་གྲུ་ཟམ་འདྲ། །ཕོངས་པ་རྣམས་ཀྱི་གཉེན་བཤེས་འདྲ། །
en: You are like a ferry to cross water And like a beloved friend to the poor.

source: ལྷ་དང་ལྷ་མིན་གཡུལ་འགྱེད་ཚེ། །ལྷ་མོ་ཁྱོད་ཀྱི་ལྟེ་བ་ལ། །ལྷ་རྣམས་ཀུན་གྱི་རྫོང་བཅས་ནས། །
en: “When the gods and asuras battled, You made a fortress for the gods Within your own navel, Goddess.

source: ལྷ་དམག་དཀར་པོ་རྒྱལ་བར་བྱས། །ལྷ་མ་ཡིན་རྣམས་ཕམ་པར་བྱེད། །
en: You brought victory to the pure army of the gods And defeated the asuras.

source: ལག་ན་མདུང་དམར་ཆེམས་སེ་ཆེམས། །རུ་མཚོན་བ་དན་མེ་ལྟར་འབར། །
en: You rattle the bloody spear you wield And your banner and standard blaze like fire.

source: དགྲ་འདུལ་གཡུལ་བཟློག་ཁྱེད་ལ་བསྟོད། །
en: “Praise to you who tames enemies and averts war!”

source: དེ་ནས་དྲང་སྲོང་ཆེན་པོ་ཀོའུ་དི་ནྱས་དཔལ་ལྷ་མོ་ལ་དཔེ་བྱད་ཀྱི་སྒོ་ནས་བསྟོད་པ། འཇིག་རྟེན་གཙོ་ལ་རྟག་ཏུ་གུས་ཕྱག་འཚལ། །
en: Next, the great ṛṣi Kauṇḍinya praised Śrīdevī in terms of her physical attributes: “I offer constant, respectful homage to the sovereign leader of the world.
